uid/sprint1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-31 Sat 17:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="milad" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgcf66ae4">1. backend&#xa0;&#xa0;&#xa0;<span class="tag"><span class="backend">backend</span></span></a>
<ul>
<li><a href="#org54190f4">1.1. security</a>
<ul>
<li><a href="#org2a4715e">1.1.1. key-exchange</a></li>
<li><a href="#org87d2a38">1.1.2. session</a></li>
<li><a href="#orgdcc47f5">1.1.3. HMAC</a></li>
<li><a href="#org46a10c6">1.1.4. Business security</a></li>
</ul>
</li>
<li><a href="#org7c3fac1">1.2. flow</a>
<ul>
<li><a href="#org94b5d54">1.2.1. create sequence diagram for labour</a></li>
<li><a href="#org4fbef23">1.2.2. design basic information endpoints</a></li>
<li><a href="#org7742725">1.2.3. unify profile information endpoints</a></li>
<li><a href="#org6ad36e9">1.2.4. implement dynamic page flow</a></li>
</ul>
</li>
<li><a href="#orga53b0b0">1.3. temporal</a>
<ul>
<li><a href="#org851a93e">1.3.1. dispatcher</a></li>
<li><a href="#orgd0195a4">1.3.2. child workflows</a></li>
<li><a href="#org004dfbf">1.3.3. business configuration service</a></li>
</ul>
</li>
<li><a href="#orge2ff083">1.4. information gathering</a>
<ul>
<li><a href="#org1dc38ba">1.4.1. database design</a></li>
<li><a href="#orgf441939">1.4.2. mongo db design</a></li>
</ul>
</li>
<li><a href="#orgc98bb64">1.5. panel APIs</a>
<ul>
<li><a href="#orga58b47d">1.5.1. get user info</a></li>
<li><a href="#org5abc636">1.5.2. accept/reject</a></li>
<li><a href="#org94e4b74">1.5.3. statistic</a></li>
<li><a href="#orgb6adfa9">1.5.4. user intospection</a></li>
<li><a href="#orga597bc5">1.5.5. </a></li>
</ul>
</li>
<li><a href="#org17803bc">1.6. Observability</a>
<ul>
<li><a href="#orgb99bd38">1.6.1. grpc logs</a></li>
<li><a href="#org5395af1">1.6.2. prometheus</a></li>
</ul>
</li>
<li><a href="#orgb3c283b">1.7. error handling</a>
<ul>
<li><a href="#org934735d">1.7.1. defining error types and general responses</a></li>
<li><a href="#orgf76b088">1.7.2. </a></li>
</ul>
</li>
<li><a href="#org68651e9">1.8. ACL</a></li>
<li><a href="#orgc9c6d43">1.9. external services</a>
<ul>
<li><a href="#orged360de">1.9.1. labour service</a></li>
<li><a href="#org454ff18">1.9.2. payment service</a></li>
</ul>
</li>
<li><a href="#org87b3230">1.10. data migration</a></li>
<li><a href="#org61df3c1">1.11. proper sms messages</a></li>
</ul>
</li>
<li><a href="#orgcaad5ec">2. front-end</a>
<ul>
<li><a href="#org8e65582">2.1. panels</a>
<ul>
<li><a href="#org5bb43e7">2.1.1. <span class="todo TODO">TODO</span> send the changes to face-matching status enum to the production</a></li>
<li><a href="#orgf12018e">2.1.2. list of users</a></li>
<li><a href="#orgba6f431">2.1.3. user information</a></li>
<li><a href="#org3580be3">2.1.4. adding font</a></li>
<li><a href="#orgbee130b">2.1.5. adding validation for search boxes</a></li>
<li><a href="#org31c4915">2.1.6. accept and reject</a></li>
<li><a href="#orgf1d02b8">2.1.7. proper message management</a></li>
<li><a href="#orgc75565b">2.1.8. ACL</a></li>
</ul>
</li>
<li><a href="#orge51cb45">2.2. web app</a>
<ul>
<li><a href="#orgc47ec33">2.2.1. errors in frontend</a></li>
<li><a href="#orgc38bbbd">2.2.2. logic</a></li>
<li><a href="#org4a1ac21">2.2.3. page</a></li>
<li><a href="#orgaec5a4a">2.2.4. components</a></li>
<li><a href="#orgcbcf245">2.2.5. validation</a></li>
<li><a href="#org7262a7e">2.2.6. code cleanup</a></li>
<li><a href="#org8272111">2.2.7. error handling</a></li>
<li><a href="#orgb508a53">2.2.8. testing</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgcf66ae4" class="outline-2">
<h2 id="orgcf66ae4"><span class="section-number-2">1.</span> backend&#xa0;&#xa0;&#xa0;<span class="tag"><span class="backend">backend</span></span></h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org54190f4" class="outline-3">
<h3 id="org54190f4"><span class="section-number-3">1.1.</span> security</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org2a4715e" class="outline-4">
<h4 id="org2a4715e"><span class="section-number-4">1.1.1.</span> key-exchange</h4>
</div>
<div id="outline-container-org87d2a38" class="outline-4">
<h4 id="org87d2a38"><span class="section-number-4">1.1.2.</span> session</h4>
</div>
<div id="outline-container-orgdcc47f5" class="outline-4">
<h4 id="orgdcc47f5"><span class="section-number-4">1.1.3.</span> HMAC</h4>
</div>
<div id="outline-container-org46a10c6" class="outline-4">
<h4 id="org46a10c6"><span class="section-number-4">1.1.4.</span> Business security</h4>
</div>
</div>
<div id="outline-container-org7c3fac1" class="outline-3">
<h3 id="org7c3fac1"><span class="section-number-3">1.2.</span> flow</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org94b5d54" class="outline-4">
<h4 id="org94b5d54"><span class="section-number-4">1.2.1.</span> create sequence diagram for labour</h4>
</div>
<div id="outline-container-org4fbef23" class="outline-4">
<h4 id="org4fbef23"><span class="section-number-4">1.2.2.</span> design basic information endpoints</h4>
<div class="outline-text-4" id="text-1-2-2">
</div>
<ol class="org-ol">
<li><a id="orgd843a8a"></a>Logo, &#x2026; endpoint<br /></li>
<li><a id="orge60bff2"></a>city and province endpoint<br /></li>
</ol>
</div>
<div id="outline-container-org7742725" class="outline-4">
<h4 id="org7742725"><span class="section-number-4">1.2.3.</span> unify profile information endpoints</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
the goal is to have one endpoint to receive different profile information like
</p>
</div>
</div>
<div id="outline-container-org6ad36e9" class="outline-4">
<h4 id="org6ad36e9"><span class="section-number-4">1.2.4.</span> implement dynamic page flow</h4>
</div>
</div>
<div id="outline-container-orga53b0b0" class="outline-3">
<h3 id="orga53b0b0"><span class="section-number-3">1.3.</span> temporal</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org851a93e" class="outline-4">
<h4 id="org851a93e"><span class="section-number-4">1.3.1.</span> dispatcher</h4>
</div>
<div id="outline-container-orgd0195a4" class="outline-4">
<h4 id="orgd0195a4"><span class="section-number-4">1.3.2.</span> child workflows</h4>
</div>
<div id="outline-container-org004dfbf" class="outline-4">
<h4 id="org004dfbf"><span class="section-number-4">1.3.3.</span> business configuration service</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
get configuration for each business
</p>
</div>
</div>
</div>
<div id="outline-container-orge2ff083" class="outline-3">
<h3 id="orge2ff083"><span class="section-number-3">1.4.</span> information gathering</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-org1dc38ba" class="outline-4">
<h4 id="org1dc38ba"><span class="section-number-4">1.4.1.</span> database design</h4>
</div>
<div id="outline-container-orgf441939" class="outline-4">
<h4 id="orgf441939"><span class="section-number-4">1.4.2.</span> mongo db design</h4>
</div>
</div>
<div id="outline-container-orgc98bb64" class="outline-3">
<h3 id="orgc98bb64"><span class="section-number-3">1.5.</span> panel APIs</h3>
<div class="outline-text-3" id="text-1-5">
</div>
<div id="outline-container-orga58b47d" class="outline-4">
<h4 id="orga58b47d"><span class="section-number-4">1.5.1.</span> get user info</h4>
</div>
<div id="outline-container-org5abc636" class="outline-4">
<h4 id="org5abc636"><span class="section-number-4">1.5.2.</span> accept/reject</h4>
</div>
<div id="outline-container-org94e4b74" class="outline-4">
<h4 id="org94e4b74"><span class="section-number-4">1.5.3.</span> statistic</h4>
</div>
<div id="outline-container-orgb6adfa9" class="outline-4">
<h4 id="orgb6adfa9"><span class="section-number-4">1.5.4.</span> user intospection</h4>
<div class="outline-text-4" id="text-1-5-4">
</div>
<ol class="org-ol">
<li><a id="orgf2c769a"></a>status in labour<br /></li>
<li><a id="org71336d5"></a>status in uid<br /></li>
</ol>
</div>
<div id="outline-container-orga597bc5" class="outline-4">
<h4 id="orga597bc5"><span class="section-number-4">1.5.5.</span> </h4>
</div>
</div>
<div id="outline-container-org17803bc" class="outline-3">
<h3 id="org17803bc"><span class="section-number-3">1.6.</span> Observability</h3>
<div class="outline-text-3" id="text-1-6">
</div>
<div id="outline-container-orgb99bd38" class="outline-4">
<h4 id="orgb99bd38"><span class="section-number-4">1.6.1.</span> grpc logs</h4>
<div class="outline-text-4" id="text-1-6-1">
<p>
the problem we have right now is if we are crashing in grpc we will not have the
logs
</p>
</div>
<ol class="org-ol">
<li><a id="orgb5a3139"></a>investigate the issue<br /></li>
</ol>
</div>
<div id="outline-container-org5395af1" class="outline-4">
<h4 id="org5395af1"><span class="section-number-4">1.6.2.</span> prometheus</h4>
</div>
</div>
<div id="outline-container-orgb3c283b" class="outline-3">
<h3 id="orgb3c283b"><span class="section-number-3">1.7.</span> error handling</h3>
<div class="outline-text-3" id="text-1-7">
</div>
<div id="outline-container-org934735d" class="outline-4">
<h4 id="org934735d"><span class="section-number-4">1.7.1.</span> defining error types and general responses</h4>
</div>
<div id="outline-container-orgf76b088" class="outline-4">
<h4 id="orgf76b088"><span class="section-number-4">1.7.2.</span> </h4>
</div>
</div>
<div id="outline-container-org68651e9" class="outline-3">
<h3 id="org68651e9"><span class="section-number-3">1.8.</span> ACL</h3>
</div>
<div id="outline-container-orgc9c6d43" class="outline-3">
<h3 id="orgc9c6d43"><span class="section-number-3">1.9.</span> external services</h3>
<div class="outline-text-3" id="text-1-9">
</div>
<div id="outline-container-orged360de" class="outline-4">
<h4 id="orged360de"><span class="section-number-4">1.9.1.</span> labour service</h4>
</div>
<div id="outline-container-org454ff18" class="outline-4">
<h4 id="org454ff18"><span class="section-number-4">1.9.2.</span> payment service</h4>
<div class="outline-text-4" id="text-1-9-2">
</div>
<ol class="org-ol">
<li><a id="org2361d08"></a>parsian service<br /></li>
<li><a id="orgd57b9f9"></a>ap service<br />
<ol class="org-ol">
<li><a id="org756b2fb"></a>investigate 517 issue<br /></li>
</ol>
</li>
</ol>
</div>
</div>
<div id="outline-container-org87b3230" class="outline-3">
<h3 id="org87b3230"><span class="section-number-3">1.10.</span> data migration</h3>
</div>
<div id="outline-container-org61df3c1" class="outline-3">
<h3 id="org61df3c1"><span class="section-number-3">1.11.</span> proper sms messages</h3>
</div>
</div>
<div id="outline-container-orgcaad5ec" class="outline-2">
<h2 id="orgcaad5ec"><span class="section-number-2">2.</span> front-end</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org8e65582" class="outline-3">
<h3 id="org8e65582"><span class="section-number-3">2.1.</span> panels</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org5bb43e7" class="outline-4">
<h4 id="org5bb43e7"><span class="section-number-4">2.1.1.</span> <span class="todo TODO">TODO</span> send the changes to face-matching status enum to the production</h4>
</div>
<div id="outline-container-orgf12018e" class="outline-4">
<h4 id="orgf12018e"><span class="section-number-4">2.1.2.</span> list of users</h4>
</div>
<div id="outline-container-orgba6f431" class="outline-4">
<h4 id="orgba6f431"><span class="section-number-4">2.1.3.</span> user information</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
when we are searching for a user and we want to get the information in
call-center we need to show user information related to payment, labour status, name and &#x2026;
in the general sense we want to present all the data that we have from the user
</p>

<p>
at the end all these data would be served encrypted to the front-end
</p>
</div>
<ol class="org-ol">
<li><a id="org99a9a1d"></a><span class="todo TODO">TODO</span> define the proper interface for it<br /></li>
<li><a id="orge8ef73c"></a>investigate the proper UX for viewing the information<br /></li>
</ol>
</div>
<div id="outline-container-org3580be3" class="outline-4">
<h4 id="org3580be3"><span class="section-number-4">2.1.4.</span> adding font</h4>
</div>
<div id="outline-container-orgbee130b" class="outline-4">
<h4 id="orgbee130b"><span class="section-number-4">2.1.5.</span> adding validation for search boxes</h4>
</div>
<div id="outline-container-org31c4915" class="outline-4">
<h4 id="org31c4915"><span class="section-number-4">2.1.6.</span> accept and reject</h4>
</div>
<div id="outline-container-orgf1d02b8" class="outline-4">
<h4 id="orgf1d02b8"><span class="section-number-4">2.1.7.</span> proper message management</h4>
</div>
<div id="outline-container-orgc75565b" class="outline-4">
<h4 id="orgc75565b"><span class="section-number-4">2.1.8.</span> ACL</h4>
<div class="outline-text-4" id="text-2-1-8">
</div>
<ol class="org-ol">
<li><a id="org7221886"></a><span class="todo TODO">TODO</span> what is the condition of the ACL&#xa0;&#xa0;&#xa0;<span class="tag"><span class="hamed">hamed</span></span><br /></li>
</ol>
</div>
</div>
<div id="outline-container-orge51cb45" class="outline-3">
<h3 id="orge51cb45"><span class="section-number-3">2.2.</span> web app</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-orgc47ec33" class="outline-4">
<h4 id="orgc47ec33"><span class="section-number-4">2.2.1.</span> errors in frontend</h4>
<div class="outline-text-4" id="text-2-2-1">
</div>
<ol class="org-ol">
<li><a id="orge53d4bb"></a>communication issues<br />
<ol class="org-ol">
<li><a id="org57e59d0"></a>slow connection<br />
<div class="outline-text-6" id="text-2-2-1-1-1">
<p>
upload taking too long
</p>
</div>
</li>
<li><a id="org3cebf1d"></a>server unreachable<br /></li>
<li><a id="orge6a4b2a"></a>time out<br /></li>
</ol>
</li>
<li><a id="org307eb50"></a>server specific error<br />
<ol class="org-ol">
<li><a id="org6c2a476"></a>500 server<br /></li>
<li><a id="orgb14c8d2"></a>validation error<br /></li>
<li><a id="org0810803"></a>security errors<br />
<ol class="org-ol">
<li><a id="org9b8eefa"></a>token expiration<br /></li>
</ol>
</li>
</ol>
</li>
<li><a id="org25e7e62"></a>general error with message<br /></li>
</ol>
</div>
<div id="outline-container-orgc38bbbd" class="outline-4">
<h4 id="orgc38bbbd"><span class="section-number-4">2.2.2.</span> logic</h4>
<div class="outline-text-4" id="text-2-2-2">
</div>
<ol class="org-ol">
<li><a id="orga957022"></a>get next page from server<br /></li>
<li><a id="orgdc13fee"></a>configuration from server<br />
<ol class="org-ol">
<li><a id="org80ed234"></a>get basic information from server<br />
<ol class="org-ol">
<li><a id="orgd702691"></a>city and province<br /></li>
<li><a id="org2aa50b8"></a>logo address<br /></li>
</ol>
</li>
<li><a id="org602648a"></a>front specific configuration<br />
<div class="outline-text-6" id="text-2-2-2-2-2">
<ul class="org-ul">
<li>liveness time</li>
<li>liveness message( liveness title)</li>
<li>timeout</li>
</ul>
</div>
</li>
</ol>
</li>
<li><a id="orgfa21214"></a>implement key-exchange<br />
<div class="outline-text-5" id="text-2-2-2-3">
<p>
key exchange is done but actually encryption and decryption using AES is not completed
</p>
</div>
</li>
<li><a id="orgf1764f5"></a>implement HMAC<br /></li>
<li><a id="org4e6953f"></a>encrypt sensitive information<br /></li>
<li><a id="orgff29d6f"></a>update user profile information endpoint<br />
<div class="outline-text-5" id="text-2-2-2-6">
<p>
we are going to unify all the information gathering mechanism into a single endpoint
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org4a1ac21" class="outline-4">
<h4 id="org4a1ac21"><span class="section-number-4">2.2.3.</span> page</h4>
<div class="outline-text-4" id="text-2-2-3">
</div>
<ol class="org-ol">
<li><a id="org305afbb"></a>complete information page<br />
<div class="outline-text-5" id="text-2-2-3-1">
<p>
the page that we get marital status and religious status and &#x2026;
to have something that indicates we are waiting on a response from server
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgaec5a4a" class="outline-4">
<h4 id="orgaec5a4a"><span class="section-number-4">2.2.4.</span> components</h4>
<div class="outline-text-4" id="text-2-2-4">
</div>
<ol class="org-ol">
<li><a id="org8c68050"></a>progress bar<br />
<div class="outline-text-5" id="text-2-2-4-1">
<p>
when uploading something we need to have progress bar
</p>
</div>
</li>
<li><a id="orged86a2b"></a>add timer logic for otp page<br /></li>
<li><a id="org6588130"></a>waiting spinner<br /></li>
</ol>
</div>
<div id="outline-container-orgcbcf245" class="outline-4">
<h4 id="orgcbcf245"><span class="section-number-4">2.2.5.</span> validation</h4>
<div class="outline-text-4" id="text-2-2-5">
</div>
<ol class="org-ol">
<li><a id="org2b0aeed"></a><span class="todo TODO">TODO</span> get a list of all the places that we need validation<br /></li>
</ol>
</div>
<div id="outline-container-org7262a7e" class="outline-4">
<h4 id="org7262a7e"><span class="section-number-4">2.2.6.</span> code cleanup</h4>
<div class="outline-text-4" id="text-2-2-6">
</div>
<ol class="org-ol">
<li><a id="orgebe186a"></a>advance redux<br /></li>
<li><a id="orgd68097c"></a>check the code smells<br /></li>
</ol>
</div>
<div id="outline-container-org8272111" class="outline-4">
<h4 id="org8272111"><span class="section-number-4">2.2.7.</span> error handling</h4>
<div class="outline-text-4" id="text-2-2-7">
</div>
<ol class="org-ol">
<li><a id="orgbfbaa77"></a>refactor into single component to handle all the errors<br /></li>
</ol>
</div>
<div id="outline-container-orgb508a53" class="outline-4">
<h4 id="orgb508a53"><span class="section-number-4">2.2.8.</span> testing</h4>
<div class="outline-text-4" id="text-2-2-8">
</div>
<ol class="org-ol">
<li><a id="orge4533da"></a>testing liveness camera<br />
<div class="outline-text-5" id="text-2-2-8-1">
<p>
since we have rewritten the module we might experience some issue.
</p>
</div>
</li>
<li><a id="org9a7df29"></a>testing picture taking with different devices<br />
<div class="outline-text-5" id="text-2-2-8-2">
<p>
specifically we are concerned with devices that have too many cameras
</p>
</div>
</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: milad</p>
<p class="date">Created: 2022-12-31 Sat 17:39</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
